# IFCGeometryInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGeometryInfo Class
Members See Also
---
A container class for Revit geometry extracted from an element.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class IFCGeometryInfo : IDisposable
```

Visual Basic
---
```text
Public Class IFCGeometryInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCGeometryInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCGeometryInfo
# See Also
IFCGeometryInfo Members
Autodesk.Revit.DB.IFC Namespace